OpenFOAMcases/2DML/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          300;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    "(inlet|outlet|jet)"
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           $inletValue;
    }
    jetwall
    {
        type            zeroGradient;
    }

    "(top|bottom)"
    {
        type            symmetry;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
