OpenFOAMcases/2DML/system/MachNo
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

    // Mandatory entries
    type            MachNo;
    libs            (fieldFunctionObjects);

    // Optional entries
    field          U;
	writeControl   writeTime;

// ************************************************************************* //
