OpenFOAMcases/2DML/system/solverInfo
// -*- C++ -*-

#includeEtc "caseDicts/postProcessing/numerical/solverInfo.cfg"

fields      ( p U T );


// ************************************************************************* //
